app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '2f5af38f5b447067e2450efb89a22f193db63be4', '2010-05-20 06:17:53', '08127bafb4d06417d2a6904c8e70eb4ebdfe3cfe', NULL, NULL, '4pcbr', 'o.s.sidorov@gmail.com', '2010-05-20 06:17:53')
---
  def create

    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `users` WHERE (login LIKE '%4pcbr%' OR name LIKE '%4pcbr%')
---
  def search
    @page_title = "Search for users"
    @users = User.all(:conditions => ["login LIKE :name OR name LIKE :name", { :name => '%' + params[:q] + '%'}])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params['id'])