app/controllers/users_controller.rb

  def add_wish
    user = self.current_user

    @gift = Gift.new(params[:gift])
    @gift.name = Sanitize.clean(@gift.name, Sanitize::Config::BASIC)
    @gift.user_id = self.current_user.id
    success = @gift && @gift.save
---
INSERT INTO `gifts` (`name`, `updated_at`, `pic_url`, `access`, `user_id`, `state`, `created_at`) VALUES('bmw m3', '2010-05-21 07:05:08', NULL, NULL, 1, NULL, '2010-05-21 07:05:08')